Tekla.Structures.Drawing.GridLine.GridLineTextPlacement
The different placing options for the Text on a Grid Line.
Use OR operator (|) to combine more than one option.
Ex. LineStart | LineEnd, to show Text on both start and end.
TextPosition = (GridLine.GridLineTextPlacement.OnlyText | GridLine.GridLineTextPlacement.LineStart | GridLine.GridLineTextPlacement.LineEnd);
The above code makes the gridlines invisible but shows all the text labels of the lines.

Tekla.Structures.Drawing.GridLine.GridLineTextPlacement.LineStart
Text shown on start of Grid Line

Tekla.Structures.Drawing.GridLine.GridLineTextPlacement.LineEnd
Text shown on end of Grid Line

Tekla.Structures.Drawing.GridLine.GridLineTextPlacement.OnlyText
Only Text shown on Grid Line, no line is drawn.